## PANDAS
### To create data, Tables and Manipulation

#### First of all we have to import pandas and numpy from python libraries

In [3]:
import pandas as pd
import numpy as np

In [4]:
lables=['w','x','y','z']
sample_list=[100,200,300,400]
array=np.array([1,2,3,4])
dict={'w':10, 'x':20, 'y':30, 'z':40}

In [6]:
pd.Series(data=sample_list)

0    100
1    200
2    300
3    400
dtype: int64

##### Series must always have (S) as capital or else it will show error

In [7]:
pd.Series(data=sample_list,index=lables)

w    100
x    200
y    300
z    400
dtype: int64

In [9]:
pd.Series(sample_list,lables)

w    100
x    200
y    300
z    400
dtype: int64

In [10]:
pd.Series(dict)

w    10
x    20
y    30
z    40
dtype: int64

## PANDAS

### Pandas Dataframe and indexing

In [12]:
sports1=pd.Series([1,2,3,4],index=['cricket','football','basketball','golf'],)
sports1

cricket       1
football      2
basketball    3
golf          4
dtype: int64

In [13]:
sports1['cricket']

1

In [14]:
sports2=pd.Series([11,2,3,4],index=['cricket','football','basketball','gof'])
sports2

cricket       11
football       2
basketball     3
gof            4
dtype: int64

In [15]:
sports1+sports2

basketball     6.0
cricket       12.0
football       4.0
gof            NaN
golf           NaN
dtype: float64

In [20]:
df1=pd.DataFrame(np.random.rand(8,5),index='A B C D E F G H'.split(),columns='Score1 Score2 Score3 Score4 Score5'.split())
df1

     Score1    Score2    Score3    Score4    Score5
A  0.604712  0.695394  0.460278  0.395283  0.484256
B  0.651724  0.959971  0.582550  0.521702  0.279101
C  0.487765  0.784337  0.581701  0.822939  0.634076
D  0.696250  0.127148  0.002887  0.739193  0.501798
E  0.434303  0.756940  0.943734  0.194841  0.379262
F  0.296340  0.271583  0.985466  0.727408  0.539584
G  0.055912  0.345239  0.204766  0.553160  0.699460
H  0.185420  0.879349  0.892606  0.868497  0.437704

In [21]:
df1["Score3"]

A    0.460278
B    0.582550
C    0.581701
D    0.002887
E    0.943734
F    0.985466
G    0.204766
H    0.892606
Name: Score3, dtype: float64

In [22]:
df1[["Score1","Score2","Score3"]]

     Score1    Score2    Score3
A  0.604712  0.695394  0.460278
B  0.651724  0.959971  0.582550
C  0.487765  0.784337  0.581701
D  0.696250  0.127148  0.002887
E  0.434303  0.756940  0.943734
F  0.296340  0.271583  0.985466
G  0.055912  0.345239  0.204766
H  0.185420  0.879349  0.892606

In [23]:
df1['Score6']=df1['Score1']+df1['Score2']
df1

     Score1    Score2    Score3    Score4    Score5    Score6
A  0.604712  0.695394  0.460278  0.395283  0.484256  1.300106
B  0.651724  0.959971  0.582550  0.521702  0.279101  1.611695
C  0.487765  0.784337  0.581701  0.822939  0.634076  1.272102
D  0.696250  0.127148  0.002887  0.739193  0.501798  0.823398
E  0.434303  0.756940  0.943734  0.194841  0.379262  1.191243
F  0.296340  0.271583  0.985466  0.727408  0.539584  0.567923
G  0.055912  0.345239  0.204766  0.553160  0.699460  0.401151
H  0.185420  0.879349  0.892606  0.868497  0.437704  1.064769

In [26]:
df2={'ID':['101','102','103','107','176'],'Name':['John','Mercy','Akash','Kavin','Lally'],'Profit':[20,54,56,87,123]}
df=pd.DataFrame(df2)
df

    ID   Name  Profit
0  101   John      20
1  102  Mercy      54
2  103  Akash      56
3  107  Kavin      87
4  176  Lally     123

In [27]:
df["ID"]

0    101
1    102
2    103
3    107
4    176
Name: ID, dtype: object

In [28]:
df[["ID","Name"]]

    ID   Name
0  101   John
1  102  Mercy
2  103  Akash
3  107  Kavin
4  176  Lally

In [29]:
df.drop("ID",axis=1)

    Name  Profit
0   John      20
1  Mercy      54
2  Akash      56
3  Kavin      87
4  Lally     123

In [30]:
df.drop(3)

    ID   Name  Profit
0  101   John      20
1  102  Mercy      54
2  103  Akash      56
4  176  Lally     123